################################################################################
# Taps                                                                         #
################################################################################
tap "avisi-cloud/tools" # for structurizr-site-generatr
tap "oven-sh/bun" # for the bun javarscript engine
tap "hashicorp/tap" # for Hashicorp software (e.g. Packer)
tap "jandedobbeleer/oh-my-posh" # Oh-My-Posh termial prompt

################################################################################
# Binaries                                                                     #
################################################################################

# Ansible -	Configuration management tool
brew "ansible"
# Asible Linter
brew "ansible-lint"
# Asciidoctor - AsciiDoc processor
brew "asciidoctor"
# Bitwarden CLI
brew "bitwarden-cli"
# Bun Javascript
brew "bun"
# chezmoi dotfiles management tool
brew "chezmoi"
# Unix Coreutils (Those that come with macos are outdated)
brew "coreutils"
# cUrl http client
brew "curl"
# FZF general-purpose command-line fuzzy finder
# Docs: https://github.com/junegunn/fzf
brew "fzf"
# Git
brew "git"
# kubectx: a tool to switch the Kubernetes context
brew "kubectx"
# jq command-line JSON processor
# Docs: https://jqlang.github.io/jq/
brew "jq"
# Mac Store commandline client
brew "mas"
# The Neovim editor
brew "neovim"
# Node Version Manager
brew "nvm"
# Oh My Posh - terminal prompt
brew "oh-my-posh"
# OpenJDK
brew "openjdk"
# Hashicorp Packer - Machine Image Builder
brew "hashicorp/tap/packer"
# Structurizr-site-generatr C4 documentation builder
brew "structurizr-site-generatr"
# tfenv: a tool to install and switch Terraform versions
brew "tfenv"
# tree command
brew "tree"
# imagemagick image manipulation tool. Used e.g. for some nvim libraries.
brew "imagemagick"
# ripgrep - a line oriented search tool. Used for support in nvim kickstart.
# Docs: https://github.com/BurntSushi/ripgrep
brew "ripgrep"
# rsync - Commandline tool to synchronize files
brew "rsync"
# fd - find alternative command line tool
brew "fd"
# prettierd - Javascrip formatter daemon
brew "prettierd"
# wget http utility
brew "wget"
# zoxoide - a smarter cd command
brew "zoxide"

################################################################################
# Apps                                                                         #
################################################################################

# Backlaze data backup tool
cask "backblaze"
# Cryptomator file encryption tool
cask "cryptomator"
# DaisyDisk disk space analyser
cask "daisydisk"
# Docker Desktop
cask "docker"
# Dropbox
cask "dropbox"
# Ghostty Terminal Emulator
cask "ghostty"
# Google Chrome web browser
cask "google-chrome"
# GPG Suite to sign git commits
cask "gpg-suite"
# Home Assistant companion app
cask "home-assistant"
# OBS for streaming and live recording
cask "obs"
# Obsidian PKM note-taking-tool
cask "obsidian"
# Setapp app collection
cask "setapp"
# Signal Messenger
cask "signal" 
# Spotify music player
cask "spotify"
# Telegram messenger client
cask "telegram"
# VLC media player
cask "vlc"
# Visual Studio Code
cask "visual-studio-code"
# Wireshark Network Analyser
cask "wireshark"

################################################################################
# Fonts                                                                        #
################################################################################
cask "font-fira-code-nerd-font"


################################################################################
# Mac Store apps                                                               #
################################################################################
mas "Pixea", id: 1507782672
mas "Magnet", id: 441258766
mas "DaisyDisk", id: 411643860
mas "Bitwarden", id: 1352778147
