################################################################################
# Taps                                                                         #
################################################################################
tap "homebrew/cask-fonts"
tap "avisi-cloud/tools" # for structurizr-site-generatr

################################################################################
# Binaries                                                                     #
################################################################################

# Asciidoctor - AsciiDoc processor
brew "asciidoctor"
# Bitwarden CLI
brew "bitwarden-cli"
# Bun Javascript
brew "bun"
# chezmoi dotfiles management tool
brew "chezmoi"
# Unix Coreutils (Those that come with macos are outdated)
brew "coreutils"
# cUrl http client
brew "curl"
# FZF general-purpose command-line fuzzy finder
# Docs: https://github.com/junegunn/fzf
brew "fzf"
# Git
brew "git"
# kubectx: a tool to switch the Kubernetes context
brew "kubectx"
# kubens: a tool to switch Kubernetes namespaces
brew "kubens"
# jq command-line JSON processor
# Docs: https://jqlang.github.io/jq/
brew "jq"
# Mac Store commandline client
brew "mas"
# The Neovim editor
brew "neovim"
# Node Version Manager
brew "nvm"
# OpenJDK
brew "openjdk"
# Structurizr-site-generatr C4 documentation builder
brew "structurizr-site-generatr"
# tfenv: a tool to install and switch Terraform versions
brew "tfenv"
# tree command
brew "tree"

################################################################################
# Apps                                                                         #
################################################################################

# Backlaze data backup tool
cask "backblaze"
# Bitwarden password manager desktop app
cask "bitwarden"
# Cryptomator file encryption tool
cask "cryptomator"
# Docker Desktop
cask "docker"
# Google Chrome web browser
cask "google-chrome"
# GPG Suite to sign git commits
cask "gpg-suite"
# iTerm 2 Terminal emulator
cask "iterm2"
# OBS for streaming and live recording
cask "obs"
# Obsidian PKM note-taking-tool
cask "obsidian"
# Spotify music player
cask "spotify"
# Telegram messenger client
cask "telegram"
# VLC media player
cask "vlc"

################################################################################
# Fonts                                                                        #
################################################################################
cask "font-fira-code-nerd-font"


################################################################################
# Mac Store apps                                                               #
################################################################################
mas "Pixea", id: 1507782672
